# 3.1
## Выполните следующие задания на Python:
#### 1. Написать программу, которая удаляет из списка все элементы, стоящие на четных позициях.
#### 2. Написать программу, которая считывает список слов и находит слова, содержащие более трех гласных букв.
#### 3. Написать программу, которая находит второй по величине элемент в списке.
#### 4. Написать программу, которая удаляет из списка все дубликаты.
#### 5. Написать программу, которая считывает данные из CSV-файла и создает словарь, где ключами являются значения в столбце «Name», а значениями — соответствующие им словари с информацией о поле, возрасте и зарплате.
#### 6. Написать программу, которая запрашивает у пользователя строку и выводит на экран все ее подстроки длиной не менее трех символов.
---
##### Используемая программа:
    VS code
---

### 1.
#### Написать программу, которая удаляет из списка все элементы, стоящие на четных позициях.

```
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
even_values = [i for i in my_list if i %2 != 0]
print(even_values)
```

### 2. 
#### Написать программу, которая считывает список слов и находит слова, содержащие более трех гласных букв.

```
with open('words.txt', 'r') as f:
    words = f.read().split()

vowels = 'aeiouyAEIOUY'

for word in words:
    count = 0
    for letter in word:
        if letter in vowels:
            count += 1
    if count > 3:
        print(word)
```

### 3.
#### Написать программу, которая находит второй по величине элемент в списке.

```
def second_largest(numbers):
    numbers.sort()
    if len(numbers) < 2:
        return None
    return numbers[-2]

numbers = [5, 3, 1, 8, 6, 4, 7]
print(second_largest(numbers))
```

### 4.
#### Написать программу, которая удаляет из списка все дубликаты.

```

```

### 5.
#### Написать программу, которая считывает данные из CSV-файла и создает словарь, где ключами являются значения в столбце «Name», а значениями — соответствующие им словари с информацией о поле, возрасте и зарплате.
 ```
 
 ```

 ### 6.
 #### Написать программу, которая запрашивает у пользователя строку и выводит на экран все ее подстроки длиной не менее трех символов.

 ```
 
 ```